xuxu998/Stm32_prj/driver/inc/stm32f4xx_driver.h
#ifndef _STM32_HEADER_
#define _STM32_HEADER_
#include "stdint.h"
#include "stm32f4xx_spi.h"
#include "stm32f4xx_i2c.h"
#include <stddef.h>

#define __vo    volatile

/* other implementation macros */

#define GPIO_BASEADDR_TO_CODE(x)                       (x == GPIOA) ? 0 : \
                                                  (x == GPIOB) ? 1 : \
                                                  (x == GPIOC) ? 2 : \
                                                  (x == GPIOD) ? 3 : \
                                                  (x == GPIOE) ? 4 : \
                                                  (x == GPIOF) ? 5 : \
                                                  (x == GPIOG) ? 6 : \
                                                  (x == GPIOH) ? 7 : \
                                                  (x == GPIOI) ? 8 : 0

/****************************************************** PROCESSOR SPECIFIC DETAIL ******************************************************/

#define NVIC_BASEADDR                             0xE000E100               /* nested vector interupt controller base address */

/*
 * ARM Cortex Mx Processor Priority Register Address Calculation
 */
#define NVIC_PR_BASE_ADDR 	((__vo uint32_t*)0xE000E400)

/*
 * ARM Cortex Mx Processor number of priority bits implemented in Priority Register
 */
#define NO_PR_BITS_IMPLEMENTED  4



/* base address of FLASH and SRAM memories */

#define FLASH_BASEADDR                          0x08000000U             /* base address of FLASh area       */
#define SRAM1_BASEADDR                          0x20000000U             /* base address of SRAM1 area       */
#define SRAM2_BASEADDR                          0x2001C000U             /* base address of SRAM2 area       */
#define ROM_ BASEADDR                           0x1FFF0000              /* base address of ROM area         */
#define SRAM                                    SRAM1_BASEADDR          /* base address of SRAM area        */
#define APB1PERIPH_BASE                         0x40000000U             /* base address of APB1 bus         */
#define APB2PERIPH_BASE                         0x40010000U             /* base address of APB2 bus         */
#define AHB1PERIPH_BASE                         0x40020000U             /* base address of AHB1 bus         */
#define AHB2PERIPH_BASE                         0x50000000U             /* base address of AHB2 bus         */
#define AHB3PERIPH_BASE                         0xA0000000U             /* base address of AHB3 bus         */
#define PERIPH_BASE                             APB1PERIPH_BASE         /* base address of peripheral       */

/*
 * Base address of peripherals which are hangin on AHB1 bus
 */

#define USBOTGHS_BASEADDR                       0x40040000U             /* base address of USBOTGHS         */
#define DMA2_BASEADDR                           0x40026400U             /* base address of DMA2             */
#define DAM1_BASEADDR                           0x40026000U             /* base address of DMA1             */
#define BKSRAM_BASEADDR                         0x40024000U             /* base address of BKSRAM           */
#define FLINTERFACE_BASEADDR                    0x40023C00U             /* base address of FLASH INTERFACE  */
#define RRC_BASEADDR                            0x40023800U             /* base address of RRC              */
#define CRC_BASEADDR                            0x40023000U             /* base address of CRC              */
#define GPIOK_BASEADDR                          0x40022800U            /* base address of GPIOK            */
#define GPIOJ_BASEADDR                          0x40022400U             /* base address of GPIOJ            */
#define GPIOI_BASEADDR                          0x40022000U             /* base address of GPIOI            */
#define GPIOH_BASEADDR                          0x40021C00U             /* base address of GPIOH            */
#define GPIOG_BASEADDR                          0x40021800U             /* base address of GPIOG            */
#define GPIOF_BASEADDR                          0x40021400U             /* base address of GPIOF            */
#define GPIOE_BASEADDR                          0x40021000U             /* base address of GPIOE            */
#define GPIOD_BASEADDR                          0x40020C00U             /* base address of GPIOD            */
#define GPIOC_BASEADDR                          0x40020800U             /* base address of GPIOC            */
#define GPIOB_BASEADDR                          0x40020400U             /* base address of GPIOB            */
#define GPIOA_BASEADDR                          0x40020000U             /* base address of GPIOA            */


/*
 * End of define base address which are hanging on AHB1 bus
 */


/*
 * Base address of peripherals which are hangin on AHB2 bus
 */

#define RNG_BASEADDR                            0x50060800U             /* base address of RNG              */
#define HASH_BASEADDR                           0x50060400U             /* base address of HASH             */
#define CRYTO_BASEADDR                          0x50060000U             /* base address of CRYPTO           */
#define DCMI_BASEADDR                           0x50060000U             /* base address of DCMI             */
#define USBOTGFS_BASEADDR                       AHB2PERIPH_BASE         /* base address of USBOTFSG         */

/*
 * End of define base address which are hanging on AHB2 bus
 */

/*
 * Base address of peripherals which are hangin on APB1 bus
 */

#define TIM2_BASEADDR                           (APB1PERIPH_BASE + 0x0000)                      /* base address of TIMER 2                          */
#define TIM3_BASEADDR                           (APB1PERIPH_BASE + 0x0400)                      /* base address of TIMER 3                          */
#define TIM4_BASEADDR                           (APB1PERIPH_BASE + 0x0800)                      /* base address of TIMER 4                          */
#define TIM5_BASEADDR                           (APB1PERIPH_BASE + 0x0C00)                      /* base address of TIMER 5                          */
#define TIM6_BASEADDR                           (APB1PERIPH_BASE + 0x1000)                      /* base address of TIMER 6                          */
#define TIM7_BASEADDR                           (APB1PERIPH_BASE + 0x1400)                      /* base address of TIMER 7                          */
#define TIM12_BASEADDR                          (APB1PERIPH_BASE + 0x1800)                      /* base address of TIMER 12                         */
#define TIM13_BASEADDR                          (APB1PERIPH_BASE + 0x1C00)                      /* base address of TIMER 13                         */
#define TIM14_BASEADDR                          (APB1PERIPH_BASE + 0x2000)                      /* base address of TIMER 14                         */
#define RTCBK_BASEADDR                          (APB1PERIPH_BASE + 0x2800)                      /* base address of RTC BACKUP                       */
#define WWDG_BASEADDR                           (APB1PERIPH_BASE + 0x2C00)                      /* base address of WWDG                             */
#define IWDG_BASEADDR                           (APB1PERIPH_BASE + 0x3000)                      /* base address of IWDG                             */
#define I2C1_BASEADDR                           (APB1PERIPH_BASE + 0x5400)                      /* base address of I2C1                             */
#define I2C2_BASEADDR                           (APB1PERIPH_BASE + 0x5800)                      /* base address of I2C2                             */
#define I2C3_BASEADDR                           (APB1PERIPH_BASE + 0x6000)                      /* base address of I2C3                             */
#define UART7_BASEADDR                          (APB1PERIPH_BASE + 0x7800)                      /* base address of UART7                            */
#define UART8_BASEADDR                          (APB1PERIPH_BASE + 0x7C00)                      /* base address of UART8                            */
#define USART2_BASEADDR                         (APB1PERIPH_BASE + 0x4400)                      /* base address of USART2                           */
#define USART3_BASEADDR                         (APB1PERIPH_BASE + 0x4800)                      /* base address of USART3                           */
#define UART4_BASEADDR                          (APB1PERIPH_BASE + 0x4C00)                      /* base address of UART4                            */
#define UART5_BASEADDR                          (APB1PERIPH_BASE + 0x5000)                      /* base address of UART5                            */
#define SPI2_BASEADDR                           (APB1PERIPH_BASE + 0x3800)                      /* base address of SPI2                             */
#define SPI3_BASEADDR                           (APB1PERIPH_BASE + 0x3C00)                      /* base address of SPI3                             */
/*
 * End of define base address which are hanging on APB1 bus
 */

