xuxu998/Stm32_prj/driver/inc/stm32f4xx_driver.h
/*
 * Base address of peripherals which are hangin on APB2 bus
 */

#define EXTI_BASEADDR                           (APB2PERIPH_BASE+0x3C00)
#define SPI1_BASEADDR                           (APB2PERIPH_BASE+0x3000)
#define SPI6_BASEADDR                           (APB2PERIPH_BASE+0x5400)
#define SPI5_BASEADDR                           (APB2PERIPH_BASE+0x5000)
#define SPI4_BASEADDR                           (APB2PERIPH_BASE+0x3400)
#define USART6_BASEADDR                         (APB2PERIPH_BASE+0x1400)
#define USART1_BASEADDR                         (APB2PERIPH_BASE+0x1000)
#define SYSCFG_BASEADDR                         (APB2PERIPH_BASE+0x3800)

/*
 * End of define base address which are hanging on APB2 bus
 */

/******************************************************  peripheral register definition structure of processor ******************************************************/

typedef struct
{
     /* data */
     __vo uint32_t ISER[8];
     	  uint8_t Reserved1[96];
     __vo uint32_t ICER[8];
     uint8_t Reserved2[96];
     __vo uint32_t ISPR[8];
     uint8_t Reserved3[96];
     __vo uint32_t ICPR[8];
     uint8_t Reserved4[96];
     __vo uint32_t IABR[8];
     uint8_t Reserved5[224];
     __vo uint32_t IPR[60];
     uint8_t Reserved6[96];
     __vo uint32_t STIR;
}__attribute__((packed)) NVIC_RegDef_t;


/******************************************************  peripheral register definition structures  ******************************************************/


typedef struct
{
    /* data */
    __vo uint32_t  MODER;                           /* GPIO port mode register                      Address offset 0x00 */
    __vo uint32_t  OTYPER;                          /* GPIO port output type register               Address offset 0x04 */
    __vo uint32_t  OSPEEDR;                         /* GPIO port output speed register              Address offset 0x08 */
    __vo uint32_t  PUPDR;                           /* GPIO port pull-up/pull-down register         Address offset 0x0C */
    __vo uint32_t  IDR;                             /* GPIO port input data register                Address offset 0x10 */
    __vo uint32_t  ODR;                             /* GPIO port output data register               Address offset 0x14 */
    __vo uint32_t  BSRR;                            /* GPIO port bit set/reset register             Address offset 0x18 */
    __vo uint32_t  LCKR;                            /* GPIO port configuration lock register        Address offset 0x1C */
    __vo uint32_t  AFR[2];                          /* GPIO alternate function register             Address offset 0x20 */
}GPIO_RegDef_t;

typedef struct
{
     /* data */
     __vo uint32_t MEMRMP;                        /* SYSCFG memory remap register                             Address offset 0x00                                         */
     __vo uint32_t PMC;                           /* SYSCFG peripheral mode configuration register            Address offset 0x04                                         */
     __vo uint32_t EXTICR[4];                     /* SYSCFG external interrupt configuration register 1       Address offset 0x08                                         */
     __vo uint32_t Reserved[2];
     __vo uint32_t CMPCR;                         /* Compensation cell control register                       Address offset 0x20                                         */

}SYSCFG_RegDef_t;

typedef struct
{
    /* data */
    __vo uint32_t CR;                               /* RCC clock control register                                                       Address offset 0x00 */
    __vo uint32_t PLLCFGR;                          /* RCC PLL configuration register                                                   Address offset 0x04 */
    __vo uint32_t CFGR;                             /* RCC clock configuration register                                                 Address offset 0x08 */
    __vo uint32_t CIR;                              /* RCC clock interrupt register                                                     Address offset 0x0C */
    __vo uint32_t AHB1RSTR;                         /* RCC AHB1 peripheral reset register                                               Address offset 0x10 */
    __vo uint32_t AHB2RSTR;                         /* RCC AHB2 peripheral reset register                                               Address offset 0x14 */
    __vo uint32_t AHB3RSTR;                         /* RCC AHB3 peripheral reset register                                               Address offset 0x18 */
         uint32_t Reserved;
    __vo uint32_t APB1RSTR;                         /* RCC APB1 peripheral reset register                                               Address offset 0x20 */
    __vo uint32_t APB2RSTR;                         /* RCC APB2 peripheral reset register                                               Address offset 0x24 */
         uint32_t Reserved1;
         uint32_t Reserved2;
    __vo uint32_t AHB1ENR;                          /* RCC AHB1 peripheral clock enable register                                        Address offset 0x30 */
    __vo uint32_t AHB2ENR;                          /* RCC AHB2 peripheral clock enable register                                        Address offset 0x34 */
    __vo uint32_t AHB3ENR;                          /* RCC AHB3 peripheral clock enable register                                        Address offset 0x38 */
         uint32_t Reserved3;
    __vo uint32_t APB1ENR;                          /* RCC APB1 peripheral clock enable register                                        Address offset 0x40 */
    __vo uint32_t APB2ENR;                          /* RCC APB2 peripheral clock enable register                                        Address offset 0x44 */
         uint32_t Reserved4;
         uint32_t Reserved5;
    __vo uint32_t AHB1LPENR;                        /* RCC AHB1 peripheral clock enable in low power mode register                      Address offset 0x50 */
    __vo uint32_t AHB2LPENR;                        /* RCC AHB2 peripheral clock enable in low power mode register                      Address offset 0x54 */
    __vo uint32_t AHB3LPENR;                        /* RCC AHB3 peripheral clock enable in low power mode register                      Address offset 0x58 */
         uint32_t Reserved6;
    __vo uint32_t APB1LPENR;                        /* RCC APB1 peripheral clock enable in low power mode register                      Address offset 0x60 */
    __vo uint32_t APB2LPENR;                        /* RCC APB2 peripheral clock enabled in low power mode                              Address offset 0x64 */
         uint32_t Reserved7;
         uint32_t Reserved8;
    __vo uint32_t BDCR;                             /* RCC Backup domain control register                                               Address offset 0x70 */
    __vo uint32_t CSR;                              /* RCC clock control & status register                                              Address offset 0x74 */
         uint32_t Reserved9;
         uint32_t Reserved10;
    __vo uint32_t SSCGR;                            /* RCC spread spectrum clock generation register                                    Address offset 0x80 */
    __vo uint32_t PLLI2SCFGR;                       /* RCC PLLI2S configuration register                                                Address offset 0x84 */

}RCC_RegDef_t;

typedef struct
{
     /* data */
     __vo uint32_t IMR;                                /* Interrupt mask register                                                       Address offset 0x00 */
     __vo uint32_t EMR;                                /* Event mask register                                                           Address offset 0x04 */
     __vo uint32_t RTSR;                               /* Rising trigger selection register                                             Address offset 0x08 */
     __vo uint32_t FTSR;                               /* Falling trigger selection register                                            Address offset 0x0C */
     __vo uint32_t SWIER;                              /* Software interrupt event register                                             Address offset 0x10 */
     __vo uint32_t PR;                                 /* Pending register                                                              Address offset 0x14 */

