xuxu998/Stm32_prj/driver/inc/stm32f4xx_driver.h
}EXTI_RegDef_t;


/* processor peripherals */

#define NVIC                        ((__vo NVIC_RegDef_t*)NVIC_BASEADDR)

/* peripherals definition */

#define GPIOA                       ((GPIO_RegDef_t*)GPIOA_BASEADDR)
#define GPIOB                       ((GPIO_RegDef_t*)GPIOB_BASEADDR)
#define GPIOC                       ((GPIO_RegDef_t*)GPIOC_BASEADDR)
#define GPIOD                       ((GPIO_RegDef_t*)GPIOD_BASEADDR)
#define GPIOE                       ((GPIO_RegDef_t*)GPIOE_BASEADDR)
#define GPIOF                       ((GPIO_RegDef_t*)GPIOF_BASEADDR)
#define GPIOG                       ((GPIO_RegDef_t*)GPIOG_BASEADDR)
#define GPIOH                       ((GPIO_RegDef_t*)GPIOH_BASEADDR)
#define GPIOI                       ((GPIO_RegDef_t*)GPIOI_BASEADDR)
#define GPIOJ                       ((GPIO_RegDef_t*)GPIOJ_BASEADDR)


#define SPI1						((SPI_RegDef_t*)SPI1_BASEADDR)
#define SPI2						((SPI_RegDef_t*)SPI2_BASEADDR)
#define SPI3						((SPI_RegDef_t*)SPI3_BASEADDR)
#define SPI4						((SPI_RegDef_t*)SPI4_BASEADDR)
#define SPI5						((SPI_RegDef_t*)SPI5_BASEADDR)
#define SPI6						((SPI_RegDef_t*)SPI6_BASEADDR)


#define I2C1                            ((I2C_RegDef_t*)I2C1_BASEADDR)
#define I2C2                            ((I2C_RegDef_t*)I2C2_BASEADDR)
#define I2C3                            ((I2C_RegDef_t*)I2C3_BASEADDR)



#define UART4                           ((UART_RegDef_t*)UART4_BASEADDR)



#define RCC                         ((RCC_RegDef_t*)RRC_BASEADDR)
#define EXTI                        ((EXTI_RegDef_t*)EXTI_BASEADDR)
#define SYSCFG                      ((SYSCFG_RegDef_t*)SYSCFG_BASEADDR)

/* Reset GPIOx peripherals */

#define GPIOA_REG_RESET()          do { RCC->AHB1RSTR |= (1<<0); RCC->AHB1RSTR &= ~(1<<0); } while(0)
#define GPIOB_REG_RESET()          do { RCC->AHB1RSTR |= (1<<1); RCC->AHB1RSTR &= ~(1<<1); } while(0)
#define GPIOC_REG_RESET()          do { RCC->AHB1RSTR |= (1<<2); RCC->AHB1RSTR &= ~(1<<2); } while(0)
#define GPIOD_REG_RESET()          do { RCC->AHB1RSTR |= (1<<3); RCC->AHB1RSTR &= ~(1<<3); } while(0)
#define GPIOE_REG_RESET()          do { RCC->AHB1RSTR |= (1<<4); RCC->AHB1RSTR &= ~(1<<4); } while(0)
#define GPIOF_REG_RESET()          do { RCC->AHB1RSTR |= (1<<5); RCC->AHB1RSTR &= ~(1<<5); } while(0)
#define GPIOG_REG_RESET()          do { RCC->AHB1RSTR |= (1<<6); RCC->AHB1RSTR &= ~(1<<6); } while(0)
#define GPIOH_REG_RESET()          do { RCC->AHB1RSTR |= (1<<7); RCC->AHB1RSTR &= ~(1<<7); } while(0)
#define GPIOI_REG_RESET()          do { RCC->AHB1RSTR |= (1<<8); RCC->AHB1RSTR &= ~(1<<8); } while(0)
#define GPIOJ_REG_RESET()          do { RCC->AHB1RSTR |= (1<<9); RCC->AHB1RSTR &= ~(1<<9); } while(0)


/* Clock enable macros for GPIOx peripherals */

#define GPIOA_PCLK_EN()         (RCC->AHB1ENR |= (1<<0))
#define GPIOB_PCLK_EN()         (RCC->AHB1ENR |= (1<<1))
#define GPIOC_PCLK_EN()         (RCC->AHB1ENR |= (1<<2))
#define GPIOD_PCLK_EN()         (RCC->AHB1ENR |= (1<<3))
#define GPIOE_PCLK_EN()         (RCC->AHB1ENR |= (1<<4))
#define GPIOF_PCLK_EN()         (RCC->AHB1ENR |= (1<<5))
#define GPIOG_PCLK_EN()         (RCC->AHB1ENR |= (1<<6))
#define GPIOH_PCLK_EN()         (RCC->AHB1ENR |= (1<<7))
#define GPIOI_PCLK_EN()         (RCC->AHB1ENR |= (1<<8))
#define GPIOJ_PCLK_EN()         (RCC->AHB1ENR |= (1<<9))
#define GPIOK_PCLK_EN()         (RCC->AHB1ENR |= (1<<10))

/* Clock enable macros for I2C peripherals */

#define I2C1_PCLK_EN()          (RCC->APB1ENR |= (1<<21))
#define I2C2_PCLK_EN()          (RCC->APB1ENR |= (1<<22))
#define I2C3_PCLK_EN()          (RCC->APB1ENR |= (1<<23))

/* Clock enable macros for SPIx peripherals */

#define SPI1_PCLK_EN()          (RCC->APB2ENR |= (1<<12))
#define SPI2_PCLK_EN()          (RCC->APB1ENR |= (1<<14))
#define SPI3_PCLK_EN()          (RCC->APB1ENR |= (1<<15))
#define SPI4_PCLK_EN()          (RCC->APB2ENR |= (1<<13))
#define SPI5_PCLK_EN()          (RCC->APB2ENR |= (1<<20))
#define SPI6_PCLK_EN()          (RCC->APB2ENR |= (1<<21))

/* Clock enable macros for USARTx peripherals*/

#define USART2_PCLK_EN()         (RCC->APB1ENR |= (1<<17))
#define USART3_PCLK_EN()         (RCC->APB1ENR |= (1<<18))
#define UART4_PCLK_EN()          (RCC->APB1ENR |= (1<<19))
#define UART5_PCLK_EN()          (RCC->APB1ENR |= (1<<20))


#define UART4_PCLK_DI()          (RCC->APB1ENR &= ~(1<<19))

/* Clcok enable macros for SYSCFG peripherals */

#define SYSCFG_PCLK_EN()         (RCC->APB2ENR |= (1<<14))

/* Clock disable macros for GPIOx peripherals */

#define GPIOA_PCLK_DI()          (RCC->AHB1ENR &= ~(1<<0))
#define GPIOB_PCLK_DI()          (RCC->AHB1ENR &= ~(1<<1))
#define GPIOC_PCLK_DI()          (RCC->AHB1ENR &= ~(1<<2))
#define GPIOD_PCLK_DI()          (RCC->AHB1ENR &= ~(1<<3))
#define GPIOE_PCLK_DI()          (RCC->AHB1ENR &= ~(1<<4))
#define GPIOF_PCLK_DI()          (RCC->AHB1ENR &= ~(1<<5))
#define GPIOG_PCLK_DI()          (RCC->AHB1ENR &= ~(1<<6))
#define GPIOH_PCLK_DI()          (RCC->AHB1ENR &= ~(1<<7))
#define GPIOI_PCLK_DI()          (RCC->AHB1ENR &= ~(1<<8))
#define GPIOJ_PCLK_DI()          (RCC->AHB1ENR &= ~(1<<9))
#define GPIOK_PCLK_DI()          (RCC->AHB1ENR &= ~(1<<10))



/* Clock disable macros for I2Cx peripherals */

#define I2C1_PCLK_DI()          (RCC->APB1ENR &= ~(1<<21))
#define I2C2_PCLK_DI()          (RCC->APB1ENR &= ~(1<<22))
#define I2C3_PCLK_DI()          (RCC->APB1ENR &= ~(1<<23))

/* Clock disable macros for SPIx peripherals */

#define SPI1_PCLK_DI()          (RCC->APB2RSTR &= ~(1<<12))
#define SPI2_PCLK_DI()          (RCC->APB1RSTR &= ~(1<<14))
#define SPI3_PCLK_DI()          (RCC->APB1RSTR &= ~(1<<15))
#define SPI4_PCLK_DI()          (RCC->APB2RSTR &= ~(1<<13))
#define SPI5_PCLK_DI()          (RCC->APB2RSTR &= ~(1<<20))
#define SPI6_PCLK_DI()          (RCC->APB2RSTR &= ~(1<<21))

/* Clock disable macros for USARTx peripherals */



/* Clock disable macros for SYSCFG peripherals */


#define ENABLE 						1
#define DISABLE 					0
#define SET 						ENABLE
#define RESET 						DISABLE
#define GPIO_PIN_SET 				1
#define GPIO_PIN_RESET 				0


/* Interupt request of microcontroller */

#define IRQ_NO_EXTI0 				6
#define IRQ_NO_EXTI1 				7
#define IRQ_NO_EXTI2 				8
#define IRQ_NO_EXTI3 				9
#define IRQ_NO_EXTI4 				10
#define IRQ_NO_EXTI9_5 				23
#define IRQ_NO_EXTI15_10 			40
#define IRQ_NO_SPI2					36
#define IRQ_NO_SPI1					35
#define IRQ_NO_SPI3					51


#define IMPLEMENTED_BITS 			4

/*macro for SPI peripheral*/

/*SPI device mode*/
#define SPI_DEVICE_MASTER 			1
#define SPI_DEVICE_SLAVE 			0
/*SPI bus config*/

#define SPI_BUS_FULL_DUPLEX			0
#define SPI_BUS_HAFL_DUPLEX			1
#define SPI_BUS_SIMPLEX_RX_ONLY		2

/*SPI Clock Speed*/

#define SPI_CLOCK_DIV2				0
#define SPI_CLOCK_DIV4				1
#define SPI_CLOCK_DIV8				2
#define SPI_CLOCK_DIV16				3
#define SPI_CLOCK_DIV32				4
#define SPI_CLOCK_DIV64				5
#define SPI_CLOCK_DIV128			6
#define SPI_CLOCK_DIV256			7

/*SPI data frame*/

#define SPI_DFF_8BITS 				0
#define SPI_DFF_16BITS				1

/*SPI CPOL and CPHA*/


