xuxu998/Stm32_prj/driver/inc/stm32f4xx_driver.h
#define SPI_CPOL_HIGH				1
#define SPI_CPOL_LOW				0
#define SPI_CPHA_HIGH				1
#define SPI_CPHA_LOW				0

/*SPI software management*/

#define SPI_SSM_EN					1
#define SPI_SSM_DI					0

/* Bit position in SPI_CR1*/

#define CPHA_BIT_POSITION			0
#define CPOL_BIT_POSITION			1
#define MSRT_BIT_POSITION			2
#define BR_BIT_POSITION				3
#define SPE_BIT_POSITION			6
#define LSB_FIRST_BIT_POSITION		7
#define SSI_BIT_POSITION			8
#define SSM_BIT_POSITION			9
#define RX_ONLY_BIT_POSITION		10
#define DFF_BIT_POSITION			11
#define CRC_NEXT_BIT_POSITION		12
#define CRC_EN_BIT_POSITION			13
#define BIDI_OE_BIT_POSITION		14
#define BIDI_MODE_BIT_POSITION		15

/*Bit position in SPI_CR2*/
#define RXDMAEN_BIT_POSITION		0
#define TXDMAEN_BIT_POSITIOn		1
#define SSOE_BIT_POSIITON			2
#define FRF_BIT_POSITION			4
#define ERRIE_BIT_POSITION			5
#define RXNEIE_BIT_POSITION			6
#define TXEIE_BIT_POSITION			7

/*Bit position in SPI_SR*/

#define RXNE_BIT_POSITION			0
#define TXE_BIT_POSITION			1
#define CHSIDE_BIT_POSITION			2
#define UDR_BIT_POSITION			3
#define CRCERR_BIT_POSITION			4
#define MODF_BIT_POSITION			5
#define SPI_OVR_BIT_POSITION		6
#define BSY_BIT_POSITION			7
#define FRE_BIT_POSITIOn			8


/* macro for I2C peripherals */

/* bit position I2C_CR1 */
#define PE_BIT_POSITION  0
#define SMBUS_MODE_BIT_POSITION 1
#define SMBUS_TYPE_BIT_POSITION 3
#define ARP_BIT_POSITION 4
#define ENPEC_BIT_POSITION 5
#define ENGC_BIT_POSITION 6
#define NOSTRETCH_BIT_POSITION 7
#define START_BIT_POSITION 8
#define STOP_BIT_POSITION 9
#define ACK_BIT_POSITION 10
#define POS_BIT_POSITION 11
#define SPI_PEC_BIT_POSITION 12
#define ALERT_BIT_POSITION 13
#define SWRST_BIT_POSITION 15

/* bit position for I2C_CR2 */
#define FREQ_BIT_POSITION 0
#define ITERREN_BIT_POSITION 8
#define ITEVTEN_BIT_POSITION 9
#define ITBUFEN_BIT_POSITION 10
#define DMAEN_BIT_POSITION 11
#define LAST_BIT_POSITION 12

/* bit position for I2C_OAR1 */
#define ADD0_BIT_POSITION 0
#define ADD_BIT_POSITION 1
#define ADD_98_BIT_POSITION 8
#define ADDMODE_BIT_POSITION 15

/* bit position for I2C_SR1 */
#define SB_BIT_POSITION 0
#define ADDR_BIT_POSITION 1
#define BTF_BIT_POSITION 2
#define ADD10_BIT_POSITION 3
#define STOPF_BIT_POSITION 4

#define RxNE_BIT_POSITION 6
#define TxE_BIT_POSITION 7
#define BERR_BIT_POSITION 8
#define ARLO_BIT_POSITION 9
#define AF_BIT_POSITION 10
#define I2C_OVR_BIT_POSITION 11
#define PECERR_BIT_POSITION 12
#define TIMEOUT_BIT_POSITION 14
#define SMBALERT_BIT_POSITION 15

/* bit position for I2C_SR2 */
#define MSL_BIT_POSITION 0
#define BUSY_BIT_POSITION 1
#define TRA_BIT_POSITION 2
#define GENCALL_BIT_POSITION 4
#define SMBDEFAULT_BIT_POSITION 5
#define SMBHOST_BIT_POSITION 6
#define DUALF_BIT_POSITION 7
#define I2C_PEC_BIT_POSITION 8

/* bit position for I2C_CCR */

#define CCR_BIT_POSITION 0
#define DUTY_BIT_POSITION 14
#define FS_BIT_POSITION 15

/*other macro*/
#define EMPTY 						0
//__attribute((weak))void __SPI_ApplicationCallback(SPI_Handle_t* pSPI_handle,uint8_t EventNumber);
#endif
